#-----------------------------------------------------------------------
# binary2.py
#-----------------------------------------------------------------------

import stdio
import sys

# 명령 줄에서 정수 n을 입력받는다.
# n의 이진 표현을 문자열에 저장하고 나서 문자열을 화면에 출력한다.

# 제한 : 음수는 처리하지 못한다.

n = int(sys.argv[1])

if n == 0:
    stdio.writeln(0)
else:
    # 계속해서 2로 나눠가며 나머지값을 뒤에서부터 추가해간다.
    s = ''
    while n > 0:
        s = str(n % 2) + s
        n //= 2

    stdio.writeln(s)
    
#-----------------------------------------------------------------------

# python binary2.py 19
# 10011

# python binary2.py 255
# 11111111

# python binary2.py 512
# 1000000000

# python binary2.py 1000000000
# 111011100110101100101000000000
